## Python Libraries - Pandas - Merge and Append

In this section, you will merge and concatenate multiple dataframes. Merging is one of the most common operations you will do, since data often comes in various files.

### Merging

For merging, we have sales data across multiple sheets in an Excel file. We will now work with all these sheets and learn to:
* Merge multiple dataframes using common columns/keys using ```pd.merge()```

Let's first read all the data files.

In [1]:
# import the required libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

file_loc = 'C:\\Users\\user1\\Documents\\Personal_Srini\\Study\\Data Science_PGDM\\Python\\Resources\\Dataset\\sales_returns.xlsx'

In [2]:
# read the sheets from file 'sales_returns.xlsx' into 2 different dataframes - orders and returns
orders = pd.read_excel(file_loc, sheet_name = "Orders")
returns = pd.read_excel(file_loc, sheet_name = "Returns")

In [3]:
# Check the shape of the dataframe 'orders'
orders.shape

(25728, 4)

In [5]:
# Check the shape of the dataframe 'returns'
returns.shape

(1079, 2)

In [8]:
# check the dataframe 'orders' and 'returns'
orders.head()

               Order ID  Market  Profit   Sales
0  AG-2012-AA6453-41020  Africa   53.76  298.68
1  AG-2012-AC4203-40915  Africa   14.58   91.38
2  AG-2012-AH2103-41133  Africa   11.04  276.96
3  AG-2012-AJ7803-40978  Africa    7.17   35.97
4  AG-2012-AS2853-41235  Africa   15.36   54.90

In [9]:
returns.head()

  Returned                  Order ID
0      Yes  CA-2012-SA20830140-41210
1      Yes  IN-2012-PB19210127-41259
2      Yes  CA-2012-SC20095140-41174
3      Yes    IN-2015-JH158207-42140
4      Yes    IN-2014-LC168857-41747

In [14]:
# Create a dataframe 'return_orders' by merging the two dataframes on Order_ID
returned_order = orders.merge(returns, on = 'Order ID')

# Check the created dataframe
returned_order.head()

                Order ID  Market  Profit    Sales Returned
0  AG-2013-PO88653-41634  Africa  191.25  1932.24      Yes
1  AG-2014-CM21603-41755  Africa   10.32    43.05      Yes
2  AG-2014-CP20853-41889  Africa   14.10    84.72      Yes
3  AG-2014-RD95853-41712  Africa   21.03    64.38      Yes
4  AO-2013-JE57454-41544  Africa  106.59   499.23      Yes

In [15]:
# Check the shape of the new dataframe
returned_order.shape

(1079, 5)

In [1]:
# try to use the 'left' method to join two dataframes
returned_orders = orders.merge(returns, on = 'Order ID', how = 'left')

# Check the created dataframe
returned_orders.head(50)

NameError: name 'orders' is not defined

In [36]:
# Check the orders where orders were returned
returned_orders[returned_orders["Returned"] == 'Yes']

                       Order ID  Market    Profit     Sales Returned
35        AG-2013-PO88653-41634  Africa  191.2500  1932.240      Yes
44        AG-2014-CM21603-41755  Africa   10.3200    43.050      Yes
45        AG-2014-CP20853-41889  Africa   14.1000    84.720      Yes
56        AG-2014-RD95853-41712  Africa   21.0300    64.380      Yes
111       AO-2013-JE57454-41544  Africa  106.5900   499.230      Yes
...                         ...     ...       ...       ...      ...
25622  US-2015-ME17320140-42322    USCA  -24.7086     9.324      Yes
25659  US-2015-PN18775140-42339    USCA    8.9970    71.976      Yes
25675  US-2015-RL19615140-42147    USCA   18.8328    49.560      Yes
25685  US-2015-SC20050140-42278    USCA  -17.4690    11.646      Yes
25717  US-2015-TT21220140-42186    USCA  100.4255   204.950      Yes

[1079 rows x 5 columns]

In [ ]:
# Print the dataframe summary using the info() command

In [37]:
# Change the data type of the column 'Returned' 
returned_orders['Returned'] = returned_orders['Returned'].astype('str')

# Check the dataframe after modification
returned_orders.head()

               Order ID  Market  Profit   Sales Returned
0  AG-2012-AA6453-41020  Africa   53.76  298.68      nan
1  AG-2012-AC4203-40915  Africa   14.58   91.38      nan
2  AG-2012-AH2103-41133  Africa   11.04  276.96      nan
3  AG-2012-AJ7803-40978  Africa    7.17   35.97      nan
4  AG-2012-AS2853-41235  Africa   15.36   54.90      nan

In [39]:
# Replace the 'nan' value with 'No' in the column 'Returned'
returned_orders['Returned'] = returned_orders['Returned'].apply(lambda x: 'No' if x == 'nan' else 'Yes')

# Check the dataframe after modification
returned_orders.head()

               Order ID  Market  Profit   Sales Returned
0  AG-2012-AA6453-41020  Africa   53.76  298.68      Yes
1  AG-2012-AC4203-40915  Africa   14.58   91.38      Yes
2  AG-2012-AH2103-41133  Africa   11.04  276.96      Yes
3  AG-2012-AJ7803-40978  Africa    7.17   35.97      Yes
4  AG-2012-AS2853-41235  Africa   15.36   54.90      Yes

### Append / Concatenate

Concatenation is much more straightforward than merging. It is used when you have dataframes having the same columns and want to append them (pile one on top of the other), or having the same rows and want to append them side-by-side.

In [ ]:
# Import the required libraries

**Appending rows in a dataframe**

In [ ]:
# Dataframes having the same columns

df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age' : ['34', '31', '22', '33'], 
                    'Gender': ['M', 'M', 'F', 'M']}
                  )

df2 = pd.DataFrame({'Name': ['Akhil', 'Asha', 'Preeti'],
                    'Age' : ['31', '22', '23'], 
                    'Gender': ['M', 'F', 'F']}
                  )

In [ ]:
# Append the rows of df2 in df1

**Appending columns in a dataframe**

In [ ]:
# Another dataframe with same number of rows as df1
df3 = pd.DataFrame({'School': ['RK Public', 'JSP', 'Carmel Convent', 'St. Paul'],
                    'Graduation Marks': ['84', '89', '76', '91']}
                  )

In [ ]:
# Concatenating the dataframes: df1 and df3

In [ ]:
# Concatenating the dataframes across column: df1 and df3

In [19]:
import numpy as np
n = 5
val = np.zeros([n, n], dtype = 'int')

In [20]:
val

array([[0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

In [21]:
mid_val = n // 2
mid_val

2

In [22]:
for i in range(0, n):
    for j in range(0, n):
        if (i == mid_val) | (j == mid_val):
            val[i][j] = 1

In [23]:
val

array([[0, 0, 1, 0, 0],
       [0, 0, 1, 0, 0],
       [1, 1, 1, 1, 1],
       [0, 0, 1, 0, 0],
       [0, 0, 1, 0, 0]])